{
    "home": {
      "welcome": "👋 HEY I'M ANAS CHAMKHI.",
      "description1": "I'm a web developer and tech enthusiast passionate about crafting intuitive digital experiences — turning ideas into fast, functional, and visually engaging web products, one line of code at a time",
      "description2":"For 5 years, I worked remotely with a Z-tech startup in france, creating real estate tools that automate workflows and simplify complex systems.",
      "description3":"Curious by nature, I love solving problems through code, blending design with function, and learning something new every day,currently exploring new adventures where I can build, grow, and leave a meaningful mark.",        
      "resume":"Resume",
      "link":"Try it out",
      "section1name":"projects",
      "section2name":"side projects",
      "section3name":"directory",
      "projects":[

        {
          "name": "ImmoCockpit",
          "type": " An analysis and decision-support tool designed for real estate professionals.",
          "year": "",
          "link": "immocockpit.fr",
          "tags": ["Nuxt.js", "Laravel", "Leafletjs", "Mapbox","Apexcharts.js","jsPDF","PostgreSQL","OpenData(APIs REST,GeoJSON)","Nginx","Figma"],
          "logo": "/immocockpit.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "Key Features:",
            "- Valuation Report Generator: Create fast, reliable, and customizable property pdf valuation reports.",
            "- Address Intelligence Map: Instantly access local data (transport, shops, schools, etc.) with dynamic route visualizations.",
            "- AI-Powered Listing Generator: Automatically generate enriched real estate listings through a smart form that includes specific criteria (beach proximity, shared housing, seasonal rentals, etc.).",
            "- Energy Audit Scan (DPE): Interactive map of energy performance diagnostics with multi-criteria filtering.",
            "- Advanced DVF Map: Analyze past property sales using precise filters (area, time period, property type, sale status)."

          ]
        },
      
          {
            "name": "Smartzone",
            "type": "Smart real estate search",
            "year": "",
            "link": "smartzone.immo",
            "tags": ["Laravel", "Vue.js", "Vuex", "Leafletjs", "Mapbox","PostgreSQL","OpenData(APIs REST,GeoJSON)","Figma"],
            "logo": "/smartzone.svg",
            "isVisitLink": true,
            "status": false,
            "description": [
              "Web platform connecting the various stakeholders in the real estate sector.",
              "Main feature: an intelligent geolocation system that calculates distances and travel times from a property to relevant points of interest (schools, shops, transport, etc.) based on different modes of transportation (car, bike, walking, public transit).",
              "Additional features:",
              "- Search for real estate based on travel time to specific locations.",
              "- Draw a custom zone on the map to filter and search properties within that area.",
              "- Browse listings of real estate ads as well as real estate agencies."
            ]
          }
      ],
      "sideProjects":[

        {
          "name": "GenImmo",
          "type": "AI-Powered real estate ad generator",
          "year": "",
          "link": "genimmo.ma",
          "tags": ["React", "Nest.js","Leafletjs", "Mapbox","MangoDB","Figma","OpenAI"],
          "logo": "/genImmooo.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "AI-Powered Real Estate Ad Generator for moroccan market",
            "A web application that automates the creation of high-quality, localized real estate ads tailored for the Moroccan market. Using AI, it generates well-written property descriptions enriched with dynamic data such as nearby points of interest (schools, shops, transport, etc.)",
            "Designed to streamline content creation for real estate agents, the tool saves time while enhancing ad consistency and quality."

          ]
        },
        {
          "name": "TrouveTonDéputé",
          "type": "French political opinion-based matchmaking voting app",
          "year": "",
          "link": "trouvetondéputé",
          "tags": ["Nuxt.js","AirTable","Vercel","OpenData(APIs REST,GeoJSON)","Figma"],
          "logo": "/trouve.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "An open-source web app that helps French voters make informed decisions for the 2024 legislative elections. Users answer a series of political questions by choosing “For” or “Against,” and the app analyzes their responses to determine which political party best matches their views. It then displays the corresponding party along with its full political program, helping users explore real alignment with current political offerings."
          ]
        }
    
      ],
      "directory":[
        {
            "name":"Collage Artworks",
            "description":"When I'm not coding, I'm cutting and layering. code is my craft, but art is my escape. View my collage works",
            "link":""
        },
        {
            "name":"Resources",
            "description":"A handpicked list of tools and guides that fuel my creative and coding workflow",
            "link":""
        },
        {
            "name":"Moodwaves",
            "description":"Music fuels my flow—here's what’s playing in my ears when I’m building cool stuff",
            "link":""
        }      
      ],
      "footer": "BY"
    },
    "ressources": {
      "name":"Ressources Hub",
      "description":"Welcome to my Resources Hub — a carefully curated collection of the tools, apps, guides, and references that I rely on throughout my creative and development process. Whether I’m designing sleek interfaces, coding functional and efficient systems, or simply looking for inspiration, these resources are part of my daily workflow",
      "links":[

        {
          "name":"Puppeteer (Headless Browser Automation)",
          "description":"A Node.js library to control Chrome/Chromium for tasks like scraping, testing, and automation.",
          "link":"https://pptr.dev/"
        },
        {
        "name":"Uncut (Free Font Resources)",
        "description":"A growing collection of high-quality, free fonts curated for designers and creatives.",
        "link":"https://uncut.wtf/"
        },

        {
        "name":"Fancy Components (UI Component Snippets)",
        "description":"A collection of beautifully crafted, ready-to-use React and Tailwind components.",
        "link":"https://www.fancycomponents.dev/"
        },
        {
          "name": "Pulsetic (Website Uptime Monitoring)",
          "description": "Free and simple uptime monitoring with beautiful status pages and instant alerts.",
          "link": "https://pulsetic.com/"
        },
        {
          "name": "Umami (Privacy-Friendly Analytics)",
          "description": "Simple, open-source web analytics that respect user privacy—no cookies, no tracking nonsense.",
          "link": "https://umami.is/"
        },
        {
          "name": "PDFShift (HTML to PDF API)",
          "description": "A powerful and easy-to-use API to convert HTML documents to high-quality PDFs.",
          "link": "https://pdfshift.io/"
        },
        {
          "name": "Mapbox (Customizable Maps & Location APIs)",
          "description": "A platform offering powerful tools and APIs to create beautiful, interactive maps.",
          "link": "https://www.mapbox.com/"
        },
        {
          "name": "Leaflet (Lightweight Interactive Maps)",
          "description": "A popular open-source JavaScript library for creating mobile-friendly, customizable interactive maps.",
          "link": "https://leafletjs.com/"
        },
        {
          "name": "Relume (Automatic Wireframing Tool)",
          "description": "A tool that automatically generates wireframes and design components to speed up your web design process.",
          "link": "https://www.relume.io/"
        },
        {
          "name": "Guerrilla Mail (Temporary Disposable Email)",
          "description": "A free service providing temporary, disposable email addresses to protect your inbox from spam.",
          "link": "https://www.guerrillamail.com/fr"
        },
        {
          "name": "Mailtrap (Email Testing Sandbox)",
          "description": "A safe environment to test, debug, and share emails without sending them to real users.",
          "link": "https://mailtrap.io/fr/email-sandbox/"
        },
        {
          "name": "Milanote (Visual Workspace for Creatives)",
          "description": "An easy-to-use tool to organize ideas, projects, and inspiration visually.",
          "link": "https://milanote.com/"
        },
        {
          "name": "Miro (Collaborative Online Whiteboard)",
          "description": "A versatile digital whiteboard platform for team collaboration, brainstorming, and project planning in real-time.",
          "link": "https://miro.com"
        },
        {
          "name": "Favicon.io (Favicon Generator)",
          "description": "A simple tool to create favicons and app icons from text, images, or emojis in seconds.",
          "link": "https://favicon.io/favicon-generator/"
        },
        {
          "name": "Obsidian (Markdown Note-Taking App)",
          "description": "A powerful, local-first knowledge base that helps you organize and link your notes with Markdown.",
          "link": "https://obsidian.md/"
        },
        {
          "name": "PocketBase (Backend as a Service)",
          "description": "A lightweight, open-source backend with realtime database, authentication, and file storage .",
          "link": "https://pocketbase.io/"
        },
        {
          "name": "Are.na (Visual Research & Collaboration Platform)",
          "description": "A tool to collect, organize, and share ideas visually through blocks and connections —",
          "link": "https://www.are.na/"
        },
        {
          "name": "Sheety (Turn Spreadsheets into APIs)",
          "description": "A tool that instantly converts Google Sheets into RESTful APIs for easy integration and automation.",
          "link": "https://sheety.co/"
        }

        


      ]
    },
    "collage":{
      "name":"Collage Artworks",
      "description":"A selection of my digital and analog collage artworks—where textures, fragments, and contrasts come together to tell visual stories."
    }
    
  }
  