{
    "home": {
      "salutation":[
        "HEY 😎",
        "SALUT 👋",
        "HOLA 🌞",
        "ПРИВЕТ",
        "こんにちは",
        "MERHABA ✨",
        "CIAO 🖐️"
      ],    
      "welcome": ", JE SUIS ANAS CHAMKHI.",
      "description1": "Développeur web et passionné de technologie, je crée des expériences digitales intuitives — transformant les idées en produits web rapides, fonctionnels et esthétiques, étape par étape.",
      "description2": "Pendant 5 ans, j'ai travaillé à distance avec la startup z-tech en France, développant des outils immobiliers qui automatisent les processus et simplifient les systèmes complexes.",
      "description3": "Curieux de nature, j’aime résoudre des problèmes avec du code, allier design et fonctionnalité, et apprendre chaque jour. Je suis aujourd’hui à la recherche de nouvelles aventures où créer, évoluer et laisser ma trace.",
      "resume":"Mon cv",
      "resumeLink":"cv.pdf",

      "link":"Essayez maintenant",
      "section1name":"projets",
      "section2name":"projets personnels",
      "section3name":"répertoire",

      "projects":[

        {
          "name": "ImmoCockpit",
          "type": "Outil d’analyse et d’aide à la décision conçu pour les professionnels de l’immobilier.",
          "year": "",
          "link": "immocockpit.fr",
          "linkName": "immocockpit.fr",
          "tags": ["Nuxt.js", "Laravel", "Leafletjs", "Mapbox","Apexcharts.js","jsPDF","PostgreSQL","OpenData(APIs REST,GeoJSON)","Nginx","Figma"],
          "logo": "/immocockpit.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "Fonctionnalités principales :",
            "- Générateur de rapports d’évaluation : création rapide, fiable et personnalisable de rapports PDF d’estimation immobilière.",
            "- Carte d’intelligence d’adresse : accès instantané aux données locales (transports, commerces, écoles, etc.) avec visualisation dynamique des itinéraires.",
            "- Générateur d’annonces enrichies par IA : création automatique d’annonces immobilières détaillées via un formulaire intelligent incluant des critères spécifiques (proximité plage, colocation, locations saisonnières, etc.).",
            "- Scan de diagnostic énergétique (DPE) : carte interactive des performances énergétiques avec filtres multicritères.",
            "- Carte avancée DVF : analyse des ventes immobilières passées avec filtres précis (surface, période, type de bien, statut de vente)."
          ]
        },
      
        {
          "name": "Smartzone",
          "type": "Recherche immobilière intelligente",
          "year": "",
          "link": "smartzone.immo",
          "linkName": "smartzone.immo",

          "tags": ["Laravel", "Vue.js", "Vuex", "Leafletjs", "Mapbox","PostgreSQL","OpenData(APIs REST,GeoJSON)","Figma"],
          "logo": "/smartzone.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "Plateforme web reliant les différents acteurs du secteur immobilier.",
            "Fonctionnalité principale : système de géolocalisation intelligent calculant distances et temps de trajet entre un bien immobilier et les points d’intérêt (écoles, commerces, transports, etc.) selon différents modes de déplacement (voiture, vélo, marche, transports en commun).",
            "Fonctionnalités supplémentaires :",
            "- Recherche immobilière basée sur le temps de trajet vers des lieux précis.",
            "- Dessin d’une zone personnalisée sur la carte pour filtrer et rechercher des biens dans cette zone.",
            "- Consultation des annonces immobilières ainsi que des agences immobilières."
          ]
        }
      ],
      
      "sideProjects":[

        {
          "name": "GenImmo",
          "type": "Générateur d’annonces immobilières  par IA",
          "year": "",
          "link": "genimmo.ma",
          "linkName":"genimmo.ma",
          "tags": ["React", "Nest.js","Leafletjs", "Mapbox","MangoDB","Figma","OpenAI"],
          "logo": "/genImmooo.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "Générateur d’annonces immobilières basé sur l’IA pour le marché marocain.",
            "Application web automatisant la création d’annonces immobilières de qualité, localisées et adaptées au marché marocain. Grâce à l’IA, elle produit des descriptions de biens bien rédigées et enrichies de données dynamiques comme les points d’intérêt à proximité (écoles, commerces, transports, etc.).",
            "Conçue pour faciliter la création de contenu des agents immobiliers, cet outil fait gagner du temps tout en améliorant la cohérence et la qualité des annonces."
          ]
        },
      
        {
          "name": "TrouveTonDéputé",
          "type": "Application de matching politique basée sur l’opinion pour les élections françaises",
          "year": "",
          "link": "trouvetondepute-git-master-chamkhianas-projects.vercel.app/",
          "linkName":"TrouveTonDéputé",
          "tags": ["Nuxt.js","AirTable","Vercel","OpenData(APIs REST,GeoJSON)","Figma"],
          "logo": "/trouve.svg",
          "isVisitLink": true,
          "status": false,
          "description": [
            "Application web open-source aidant les électeurs français à faire un choix éclairé pour les élections législatives 2024. Les utilisateurs répondent à une série de questions politiques en choisissant « Pour » ou « Contre ». L’application analyse leurs réponses pour déterminer le parti politique qui correspond le mieux à leurs opinions. Elle affiche ensuite ce parti avec son programme complet, facilitant ainsi la découverte d’un véritable alignement avec les propositions politiques actuelles."
          ]
        }
      
      ],
      


      
    
      "directory": [
        {
          "name": "Collages",
          "description": "Quand je ne code pas, je crée des collages en découpant et superposant des images. Découvrez mes œuvres.",
          "link":"/collage"
        },
        {
          "name": "Ressources",
          "description": "Une sélection d’outils et de guides essentiels qui nourrissent ma créativité et mon travail de développement.",
          "link":"/ressources"
        },
        {
          "name": "Moodwaves",
          "description": "La musique qui m’accompagne et nourrit mon inspiration quand je code mes projets.",
          "link":"/radio"
        }
      ],
      "footer": "PAR"
    },
    "ressources": {
        "name": "Centre de Ressources",
        "description": "Bienvenue dans mon Centre de Ressources — une collection soigneusement sélectionnée d’outils, d’applications, de guides et de références que j’utilise tout au long de mon processus créatif et de développement. que je conçoive des interfaces élégantes, que je code des systèmes fonctionnels et efficaces, ou que je cherche simplement de l’inspiration, ces ressources font partie de mon quotidien.",
        "links": [
          {
            "name": "Puppeteer (Automatisation de Navigateur Sans Interface)",
            "description": "Une bibliothèque Node.js pour contrôler Chrome/Chromium afin de réaliser des tâches telles que le scraping, les tests et l’automatisation.",
            "link": "https://pptr.dev/"
          },
          {
            "name": "Uncut (Ressources de Polices Gratuites)",
            "description": "Une collection croissante de polices gratuites et de haute qualité, sélectionnées pour les designers et les créatifs.",
            "link": "https://uncut.wtf/"
          },
          {
            "name": "Fancy Components (Extraits de Composants UI)",
            "description": "Une collection de composants React et Tailwind magnifiquement conçus et prêts à l'emploi.",
            "link": "https://www.fancycomponents.dev/"
          },
          {
            "name": "Pulsetic (Surveillance de Disponibilité de Sites Web)",
            "description": "Une surveillance de disponibilité gratuite et simple avec des pages de statut attrayantes et des alertes instantanées.",
            "link": "https://pulsetic.com/"
          },
          {
            "name": "Umami (Analyse Respectueuse de la Vie Privée)",
            "description": "Une solution d'analyse web simple et open-source qui respecte la vie privée des utilisateurs — sans cookies ni suivi abusif.",
            "link": "https://umami.is/"
          },
          {
            "name": "PDFShift (API HTML vers PDF)",
            "description": "Une API puissante et facile à utiliser pour convertir des documents HTML en PDF de haute qualité.",
            "link": "https://pdfshift.io/"
          },
          {
            "name": "Mapbox (Cartes Personnalisables & APIs de Localisation)",
            "description": "Une plateforme offrant des outils puissants et des APIs pour créer des cartes interactives et esthétiques.",
            "link": "https://www.mapbox.com/"
          },
          {
            "name": "Leaflet (Cartes Interactives Légères)",
            "description": "Une bibliothèque JavaScript open-source populaire pour créer des cartes interactives personnalisables et adaptées aux mobiles.",
            "link": "https://leafletjs.com/"
          },
          {
            "name": "Relume (Outil de Maquettage Automatique)",
            "description": "Un outil qui génère automatiquement des wireframes et des composants de design pour accélérer votre processus de conception web.",
            "link": "https://www.relume.io/"
          },
          {
            "name": "Guerrilla Mail (Email Temporaire et Jetable)",
            "description": "Un service gratuit fournissant des adresses email temporaires et jetables pour protéger votre boîte de réception du spam.",
            "link": "https://www.guerrillamail.com/fr"
          },
          {
            "name": "Mailtrap (Bac à Sable pour Tests d'Email)",
            "description": "Un environnement sécurisé pour tester, déboguer et partager des emails sans les envoyer à de vrais utilisateurs.",
            "link": "https://mailtrap.io/fr/email-sandbox/"
          },
          {
            "name": "Milanote (Espace Visuel pour Créatifs)",
            "description": "Un outil facile à utiliser pour organiser visuellement des idées, des projets et de l'inspiration.",
            "link": "https://milanote.com/"
          },
          {
            "name": "Miro (Tableau Blanc Collaboratif en Ligne)",
            "description": "Une plateforme de tableau blanc numérique polyvalente pour la collaboration d'équipe, le brainstorming et la planification de projets en temps réel.",
            "link": "https://miro.com"
          },
          {
            "name": "Favicon.io (Générateur de Favicon)",
            "description": "Un outil simple pour créer des favicons et des icônes d'applications à partir de texte, d'images ou d'emojis en quelques secondes.",
            "link": "https://favicon.io/favicon-generator/"
          },
          {
            "name": "Obsidian (Application de Prise de Notes en Markdown)",
            "description": "Une base de connaissances puissante, locale, qui vous aide à organiser et relier vos notes en Markdown.",
            "link": "https://obsidian.md/"
          },
          {
            "name": "PocketBase (Backend en tant que Service)",
            "description": "Un backend open-source léger avec base de données en temps réel, authentification et stockage de fichiers.",
            "link": "https://pocketbase.io/"
          },
          {
            "name": "Are.na (Plateforme de Recherche Visuelle & Collaboration)",
            "description": "Un outil pour collecter, organiser et partager des idées visuellement via des blocs et des connexions.",
            "link": "https://www.are.na/"
          },
          {
            "name": "Sheety (Convertir des Tableurs en APIs)",
            "description": "Un outil qui convertit instantanément les Google Sheets en APIs RESTful pour une intégration et automatisation faciles.",
            "link": "https://sheety.co/"
          }
        ]
    },
    "collage": {
      "name": "Œuvres de Collage",
      "description": "Une sélection de mes œuvres de collage numériques — où textures, fragments et contrastes s’unissent pour raconter des histoires visuelles."
    },
    "radio": {
      "name": "Moodwaves — Ma Bande-Son Pour Coder et Créer",
      "description": "Une bonne playlist alimente ma concentration et ma créativité. Celle-ci reflète parfaitement l’énergie et l’ambiance qui m’accompagnent quand je code ou que je crée. Plongez dedans, ressentez le flow, et laissez-vous porter par les sons qui nourrissent chaque ligne et chaque pixel."
    }
    
    
  
  }
  